#DATA file

import csv

filepath = 'myfile1.txt'

listbox = [['เลขที่','ชื่อ-นามสกุล','ตําแหน่ง','เงินเดือน','เวลา OT','เงินโบนัส','สรุปยอดเงิน'],
           ['1','พงศกร แก้วจันทร์ฤทธิ์','เจ้าหน้าที่ออกแบบกราฟฟิก','18500','0',' 0','18500'],
           ['2','เจษฎาภรณ์ พาณิชพิสิฐ','ผู้จัดการฝ่ายการเงิน','35000','0',' 0','35000'],
           ['3','สิทธิศักดิ์ รออดพระยา','เจ้าหน้าที่ฝ่ายบัญชี','18000','0',' 0','18000'],
           ['4','ธนกิต จงพิเศษ','ผู้จัดการฝ่ายการตลาด','23000','0',' 0','23000'],
           ['5','ณพัช สมชัย','เจ้าหน้าที่การเงิน','18000','0',' 0','18000'],
           ['6','พาคิน เจริญกิต','ผู้จัดการฝ่ายต่างประเทศ','23000','0',' 0','23000'],
           ['7','ธนัช ณรงค์','เจ้าหน้าที่ไอที','18500','0',' 0','18500'],
           ['8','วิวัฒน์ ครุพาณิช','เจ้าหน้าที่บัญชี','18000','0',' 0','18000'],
           ['9','ประสิทธิ์ ทรงมี','เจ้าหน้าที่บัญชี','18000','0',' 0','18000']]

with open(filepath,'w',encoding='utf-8')as outfile:
    writer = csv.writer(outfile,lineterminator='\n')
    writer.writerows(listbox)

print('end of file')
